docs: switch client structure diagram to mermaid
